dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Master/i2clib.c
/* *****************************************************************************************
 *   File Name: i2clib.c
 *   Description: Hardware I2C library source file for PIC18 series Q43 microcontrollers.
 *   This library provides an interface for performing I2C operations, including reading
 *   and writing data as either a master or slave device. The library is designed to be
 *   used with the I2C1 module provided by the PIC18___Q43, and it supports both 7-bit
 *   and 10-bit addressing modes.
 *   Author: Dewayne Hafenstein
 *   Date: 2026-05-19
 *
 *   Copyright (c) 2026, Dewayne Hafenstein.
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 *
 ***************************************************************************************** */
#include <xc.h>
#include <string.h>
#include "i2clib.h"

#ifndef _XTAL_FREQ
#define _XTAL_FREQ 64000000UL
#endif

#ifndef PPS_Unlock
#define PPS_Unlock()               \
    do                             \
    {                              \
        PPSLOCK = 0x55;            \
        PPSLOCK = 0xAA;            \
        PPSLOCKbits.PPSLOCKED = 0; \
    } while (0)
#endif

#ifndef PPS_Lock
#define PPS_Lock()                 \
    do                             \
    {                              \
        PPSLOCK = 0x55;            \
        PPSLOCK = 0xAA;            \
        PPSLOCKbits.PPSLOCKED = 1; \
    } while (0)
#endif

static i2c_handle_t *active_handle = NULL; // Active handle for ISR access

/// @brief Clears all I2C interrupt flags.
/// @param None
/// @return None
static void i2c_clearInterruptFags(void)
{
    PIR7bits.I2C1RXIF = 0;
    PIR7bits.I2C1TXIF = 0;
    PIR7bits.I2C1IF = 0;
    PIR7bits.I2C1EIF = 0;
}

/// @brief Formats a 7-bit I2C address with the read/write bit.
/// @param device_address The 7-bit I2C device address.
/// @param read True for a read operation, false for a write operation.
/// @return The formatted 7-bit I2C address structure.
static i2c_address7_t format_7bit_address(uint8_t device_address, bool read)
{
    i2c_address7_t addr;
    addr.bits.value = device_address & 0x7F; // Ensure the address is 7 bits
    addr.bits.rw = read ? 1 : 0;             // Set the R/W bit based on the read parameter
    return addr;
}

/// @brief Formats a 10-bit I2C address with the read/write bit.
/// @param device_address The 10-bit I2C device address.
/// @param read True for a read operation, false for a write operation.
/// @return The formatted 10-bit I2C address structure.
static i2c_address10_t format_10bit_address(uint16_t device_address, bool read)
{
    i2c_address10_t addr;
    addr.address.bits.reserved = 0b11110;                     // Reserved bits
    addr.address.bits.value = (device_address >> 8U) & 0x03U; // High 2 address bits
    addr.address.bits.rw = read ? 1U : 0U;                    // Set the R/W bit based on the read parameter
    addr.address_l = (uint8_t)(device_address & 0xFFU);       // Get the low byte of the address
    return addr;
}

/// @brief Initializes the I2C handle with the specified mode and channel. This function
/// must be called before any I2C operations can be performed. It sets up the I2C
/// peripheral with the desired configuration, including the addressing mode and channel.
/// @param handle Pointer to the I2C handle structure.
/// @param mode The I2C mode to be used (e.g., master, slave, multi-master).
/// @param channel The I2C channel to be used.
/// @param mode The I2C mode to be used (e.g., master, slave, multi-master).
/// @param speed The I2C clock speed in kHz. This parameter is used to calculate the
/// appropriate timing for I2C operations. The driver will compute the necessary clock
/// settings based on the provided speed and will select the appropriate clock source
/// for the I2C peripheral to achieve the desired communication speed.
/// @return The status of the I2C initialization, indicating success or any errors
i2c_status_t i2c_init(i2c_handle_t *handle, uint8_t channel, i2c_mode_t mode, uint16_t speed)
{
    if (handle == NULL)
    {
        return I2C_ERROR; // Handle pointer is null, cannot initialize
    }

    if (handle->initialized && handle->signature == I2C_HANDLE_SIGNATURE)
    {
        return I2C_ERROR_ALREADY_INITIALIZED; // Handle is already initialized, do not reinitialize
    }
    if (speed < 100 || speed > 5000)
    {
        return I2C_ERROR_INVALID_SPEED; // Invalid speed parameter, must be between 100 and 5000 kHz
    }

    memset(handle, 0x00, sizeof(i2c_handle_t)); // Clear the entire handle structure
    handle->mode = mode;
    handle->channel = channel;
    handle->speed_khz = speed;
    handle->signature = I2C_HANDLE_SIGNATURE;
    handle->current_operation = I2C_OP_NONE; // Set the initial operation state

    // Common hardware initialization regardless of mode
    I2C1CON0bits.EN = 0;    // Disable the module
    TRISCbits.TRISC3 = 0;   // set to output pin
    TRISCbits.TRISC4 = 0;   // set to output pin
    ANSELCbits.ANSELC3 = 0; // Digital mode
    ANSELCbits.ANSELC4 = 0; // Digital mode
    ODCONCbits.ODCC3 = 1;   // Open-drain configuration
    ODCONCbits.ODCC4 = 1;   // Open-drain configuration

    PPS_Unlock();
    RC3PPS = 0x37;         // RC3 -> I2C1 SCL
    RC4PPS = 0x38;         // RC4 -> I2C1 SDA
    I2C1SCLPPS = 0b010011; // I2C1 SCL -> RC3
    I2C1SDAPPS = 0b010100; // I2C1 SDA -> RC4
    PPS_Lock();
    __delay_us(100); // Delay to allow the I2C lines to stabilize after configuration

    I2C1PIR = 0x00; // Clear all pending module events
    I2C1ERR = 0x00; // Clear all pending error conditions
    I2C1PIE = 0xDF; // Enable all interrups for the I2C module

