dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Master/i2clib.c
    return I2C_SUCCESS; // Return success status for now (actual implementation needed)
}

/// @brief The I2C "General" interrupt service routine.
/// The "general" interrupt is triggered whenever any of the interrupt flags in the I2C Peripheral
/// Interrupt Register (I2C1PIR) are set, indicating that an I2C event has occurred that requires
/// attention, if the corresponding enable bit in the I2C Peripheral Interrupt Enable Register
/// (I2C1PIE) is set, and if the global interrupt enable is set. This ISR will need to check the
/// specific flags in I2C1PIR to determine the cause of the interrupt (e.g., byte count complete,
/// start condition detected, stop condition detected, error condition, etc.) and
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1), high_priority) i2c1_generalISR(void)
{
    if (active_handle == NULL || !active_handle->initialized)
    {
        return;
    }

    // Check the specific flags in I2C1PIR to determine the cause of the interrupt and take appropriate action
    if (PIR7bits.I2C1IF) // Check for general I2C event interrupt
    {
        PIR7bits.I2C1IF = 0; // Clear the general I2C event interrupt flag
        // Handle the specific I2C event based on the current operation and flags
        // (e.g., check for byte count complete, start/stop condition detected, etc.)
        // and take appropriate action (e.g., update status, signal waiting tasks, etc.)
    }
}

/// @brief The I2C "Error" interrupt service routine. This ISR is triggered when an error condition
/// occurs on the I2C bus, such as a NACK received, bus collision, or other error events as
/// indicated by the flags in the I2C Peripheral Interrupt Register (I2C1PIR) and the I2C Error
/// Register (I2C1ERR). The ISR will need to check the specific error flags to determine the
/// cause of the error and take appropriate action, such as clearing the error flags, updating
/// the transfer status, and signaling any waiting tasks or callbacks about the error condition.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1E), high_priority) i2c1_errorISR(void)
{

    if (active_handle == NULL || !active_handle->initialized)
    {
        return;
    }

    // Check for specific error conditions based on the flags in I2C1PIR and I2C1ERR
    // and take appropriate action (e.g., clear flags, update status, signal waiting tasks, etc.)
    if (I2C1ERRbits.NACKIF) // Check for NACK received error
    {
        I2C1ERRbits.NACKIF = 0;                          // Clear the NACK error flag
        active_handle->status = I2C_ERROR_NACK_RECEIVED; // Update the handle status to indicate a NACK error
        // Additional error handling actions can be taken here (e.g., signal waiting tasks, reset state, etc.)
    }
    if (I2C1ERRbits.BCLIF) // Check for bus collision error
    {
        I2C1ERRbits.BCLIF = 0;                           // Clear the bus collision error flag
        active_handle->status = I2C_ERROR_BUS_COLLISION; // Update the handle status to indicate a bus collision error
        // Additional error handling actions can be taken here (e.g., signal waiting tasks, reset state, etc.)
    }
    // Check for other error conditions as needed and handle them accordingly

    active_handle->current_operation = I2C_OP_NONE; // Clear the current operation state due to the error
    active_handle = NULL;                           // Clear the active handle since the transfer is now complete due to the error
    // The ISR will automatically stop being called once the transfer is complete and the handle
}

/// @brief The I2C "Transmit" interrupt service routine.
/// This ISR is triggered when the I2C module is ready to transmit the next byte of data on the
/// bus. The ISR will need to check the current operation state (e.g., master write, slave
/// transmit, etc.) and load the next byte of data into the appropriate transmit register
/// (e.g., I2C1TXB) based on the user's buffer and the current position in the transfer. The
/// ISR may also need to check for conditions such as the byte count being complete, a stop
/// condition being detected, or an error condition occurring during transmission, and take
/// appropriate action based on those conditions.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1TX), high_priority) i2c1_transmitISR(void)
{
    if (active_handle == NULL || !active_handle->initialized ||
        (active_handle->current_operation != I2C_OP_WRITE && active_handle->current_operation != I2C_OP_WRITE_READ))
    {
        return;
    }

    // Check if there are more bytes to transmit
    if (active_handle->tx_pos < active_handle->tx_buffer_size)
    {
        I2C1TXB = active_handle->tx_buffer[active_handle->tx_pos]; // Load the next byte to transmit
        active_handle->tx_pos++;                                   // Move to the next byte position
    }
    else
    {
        // Everything to transmit has been sent.  If we were in write_read mode, switch to
        // the read mode now to complete the repeated start condition and address phase for the read portion of the transfer.
        if (active_handle->current_operation == I2C_OP_WRITE_READ)
        {
            // We need to switch to read mode and reformat the address with the R/W bit set for read before the next transmission occurs in the ISR.
            switch (active_handle->mode)
            {
            case I2C_MODE_MASTER_7BIT:
                active_handle->device_address.address7.bits.rw = 1;          // Set the R/W bit for read
                I2C1ADB1 = active_handle->device_address.address7.address_l; // Load the 7-bit address with the read bit into ADB1
                break;
            case I2C_MODE_MASTER_10BIT:
                active_handle->device_address.address10.address.bits.rw = 1;          // Set the R/W bit for read
                I2C1ADB0 = active_handle->device_address.address10.address_l;         // Load low byte into ADB0
                I2C1ADB1 = active_handle->device_address.address10.address.address_h; // Load high byte with read bit into ADB1
                break;
            default:
                active_handle->status = I2C_ERROR_ILLEGAL_STATE;
                active_handle->current_operation = I2C_OP_NONE;
                active_handle = NULL;
                return;
            }
            I2C1CNT = (uint8_t)active_handle->rx_buffer_size; // Load the byte count for the read portion of the transfer
            active_handle->rx_pos = 0;                        // Reset the position for receiving bytes
            I2C1CON0bits.RSEN = 1;                            // Assert a repeated start condition to begin the read portion of the transfer
            active_handle->current_operation = I2C_OP_READ;   // Update state for receive ISR handling
        }
        else
        {
            // All bytes have been transmitted for a write-only operation, we can complete the transfer now.
            // STOP is generated by the hardware sequence as the transfer counter completes.
            active_handle->current_operation = I2C_OP_NONE; // Clear the current operation state
            active_handle = NULL;                           // Clear the active handle since the transfer is complete
            // The ISR will automatically stop being called once the transfer is complete and the handle
            // is cleared
        }
    }
}

/// @brief The I2C "Receive" interrupt service routine.
/// This ISR is triggered when a byte has been received on the I2C bus and is available in the
/// receive buffer. The ISR will need to read the received byte from the appropriate register,
/// store it in the user's buffer, and update the transfer status accordingly. The ISR may also
/// need to check for conditions such as the byte count being complete, a stop condition being
/// detected, or an error condition occurring during reception, and take appropriate action
/// based on those conditions.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1RX), high_priority) i2c1_receiveISR(void)
{
    if (active_handle == NULL || !active_handle->initialized ||
        (active_handle->current_operation != I2C_OP_READ && active_handle->current_operation != I2C_OP_WRITE_READ))
    {
        return;
    }

    // Check if there is space in the user's buffer to store the received byte
    if (active_handle->rx_pos < active_handle->rx_buffer_size)
    {
        active_handle->rx_buffer[active_handle->rx_pos] = I2C1RXB; // Read the received byte into the user's buffer
        active_handle->rx_pos++;                                   // Move to the next byte position
    }
    else
    {
        // Buffer overflow condition - more bytes received than the user's buffer can hold
        // Handle this condition as needed (e.g., discard additional bytes, set an error status, etc.)
        active_handle->status = I2C_ERROR_BUFFER_OVERFLOW; // Update the handle status to indicate a buffer overflow error
    }
}